DataProcessors/ОбработкаПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаПользователи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивПользователей</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаПользователи/Ext/ObjectModule.bsl
// ================================================
// ПУНКТ 5 — Создание структуры
// ================================================
Функция СоздатьСтруктуруПользователей() Экспорт
    
    МассивДанных = Новый Массив;
    Выборка = Справочники.Пользователи.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        Данные = Новый Структура;
        Данные.Вставить("Код",      Выборка.Код);
        Данные.Вставить("Фамилия",  Выборка.Фамилия);
        Данные.Вставить("Имя",      Выборка.Имя);
        
        МассивДанных.Добавить(Данные);
    КонецЦикла;
    
    Возврат МассивДанных;
    
КонецФункции

// ================================================
// ПУНКТ 6 — Обработка структуры
// ================================================
Процедура ОбработатьСтруктуруПользователей(ДанныеСтруктуры) Экспорт
    
    Если ДанныеСтруктуры = Неопределено ИЛИ ДанныеСтруктуры.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    
    Сообщить("Элементов до обработки: " + ДанныеСтруктуры.Количество());
    
    МаксДлина = -1;
    Лучший = Неопределено;
    
    Для Каждого Эл Из ДанныеСтруктуры Цикл
        Длина = СтрДлина(Эл.Фамилия) + СтрДлина(Эл.Имя);
        Если Длина > МаксДлина Тогда
            МаксДлина = Длина;
            Лучший = Эл;
        КонецЕсли;
    КонецЦикла;
    
    Если Лучший <> Неопределено Тогда
        Сообщить("Самый длинный ФИО: " + Лучший.Фамилия + " " + Лучший.Имя + " (" + МаксДлина + ")");
    КонецЕсли;
    
    ПоследнийИндекс = ДанныеСтруктуры.ВГраница();
    Последний = ДанныеСтруктуры[ПоследнийИндекс];
    ДанныеСтруктуры.Удалить(ПоследнийИндекс);
    
    Сообщить("Удалён из массива: " + Последний.Фамилия);
    
КонецПроцедуры

// ================================================
// ПУНКТ 7 — Пользователи без отчества
// ================================================
Функция ПолучитьПользователейБезОтчества() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Пользователи.Код КАК Код,
    |	Пользователи.Фамилия КАК Фамилия,
    |	Пользователи.Имя КАК Имя
    |ИЗ
    |	Справочник.Пользователи КАК Пользователи
    |ГДЕ
    |	Пользователи.Отчество = """"
    |УПОРЯДОЧИТЬ ПО
    |	Пользователи.Фамилия";
    
    Возврат Запрос.Выполнить().Выгрузить(); 
КонецФункции
